[
    {
        "id": "5a6f58da",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">World Book Day &ndash; the test teen reads</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">by Genny Haslett, 24, English literature teacher at Bathampton Secondary School</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">It is often suggested that teachers and librarians aren&rsquo;t pushing secondary school readers towards titles that challenge them enough, and so the organisers of World Book Day have announced a list which might provide some inspiration for anyone who&rsquo;s stuck for ideas. This list of popular books for young adults, voted for by 10,000 people across the UK, features a top 10 to &lsquo;shape and inspire&rsquo; teenagers, and handle some of the challenges of adolescence.</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">All but one of the books have already been made into films, demonstrating that when a book makes it to the big screen, it often then acquires more readers thanks to the film&rsquo;s success. Of course, this isn&rsquo;t always the case, as with George Orwell&rsquo;s 1984, where the rather mediocre film does not compare so favourably with the book&rsquo;s ability to conjure up a dark vision of life in a police state.</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">James Bowen&rsquo;s A Streetcat Named Bod, published in 2012, is one of the few relatively contemporary books here. It&rsquo;s also certainly for me the least predictable member of the list, but its extended stay on the bestseller list earned it &ndash; and its author &ndash; a devoted following. It is the touching story of Bob, the cat who helped a homeless man called James get his life back on track. Bob sits on James&rsquo;s shoulder and sleeps at his feet while he plays the guitar on the street, and soon becomes the centre of attention. What makes the story particularly powerful is that it is based on author James Bowen&rsquo;s real life.</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">Also on the list are J. K. Rowling&rsquo;s Harry Potter books. In this case it&rsquo;s actually the whole series rather than one particular title that makes the shortlist. Perhaps the judges struggled to agree which one book to pick. For me, the books are rather more pre-teen than the rest of the books on the list, which are aimed at a more mature readership.</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">But Harry Potter is a special case: as Harry gets older in each successive book in the series, the stories do become more complex and darker. In a way, readers themselves grow up with Harry and his friends. Rowling asks some tough questions about standing up to authority, challenging &lsquo;normal&rsquo; views and many other subjects close to teenage readers&rsquo; hearts. This should get rid of the idea that the whole series is just for young kids. In actual fact, half of all Harry Potter readers are over the age of 35, but that&rsquo;s another story.</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">The list goes right back to the nineteenth century with Charlotte Bronte&rsquo;s great romance Jane Eyre, showing that some books never grow old, though the majority are twentieth-century works such as Anne Frank&rsquo;s heartbreaking wartime memoir The Diary of a Young Girl, which even now I find hard to get through without shedding tears. Personally, I would have swapped J. R. R. Tolkien&rsquo;s The Lord of the Rings for one of the many classics that didn&rsquo;t make the final selection, Lord of the Flies perhaps, William Golding&rsquo;s nightmare vision of schoolboys stuck on an island.</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">Of course there&rsquo;ll always be some choices we don&rsquo;t agree with, but that&rsquo;s what I think makes a list like this so fascinating. I&rsquo;ve been using it with my class of 16-year-olds, and I got them to evaluate it and make other suggestions for what to include or how it could be changed. But what I hope can really make a lasting difference is if it stimulates them to try out writers on the list, perhaps ones they haven&rsquo;t come across before, and be introduced to new styles of writing.&nbsp;</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">You are going to read an article about a list of books for teenage readers. For questions 1-6, choose the answer (A, B, C or D) which you think fits best according to the text.</span></p>\r\n<p dir=\"ltr\" style=\"text-align: justify;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\"><strong>QUESTION 1 - </strong>&nbsp;What criticism does the writer make in the first paragraph?</span></p>",
        "audio": "",
        "alternativas": {
            "A": "World Book Day has been poorly organised.",
            "B": "School librarians aren’t working hard enough.",
            "C": "Teenagers are reading books that are too easy.",
            "D": "Teachers don’t encourage pupils to read enough."
        },
        "resposta": "C"
    },
    {
        "id": "3139667b",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 2 -&nbsp;</strong>What point is made about books which are made into films?</p>",
        "audio": "",
        "alternativas": {
            "A": "The best books tend to be made into films.",
            "B": "The film of a book makes more people read the book.",
            "C": "Many people prefer to watch a film than read the book.",
            "D": " It is useful to be able to compare the book and the film."
        },
        "resposta": "B"
    },
    {
        "id": "b0cbafea",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 3 - </strong>What does the writer suggest about <em>A Streetcat Named Bob</em>?</p>",
        "audio": "",
        "alternativas": {
            "A": "She is surprised that it is on the list.",
            "B": "The book did not sell as well as it deserved to.",
            "C": "It is the most recently published book on the list.",
            "D": "It is the only autobiography on the list."
        },
        "resposta": "A"
    },
    {
        "id": "b2082194",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 4 - </strong>How does the writer justify the presence of the <em>Harry Potter</em> books on the list?</p>",
        "audio": "",
        "alternativas": {
            "A": "The books’ fame can help the list get more attention.",
            "B": "The later books in the series are more suitable for teenagers.",
            "C": "Teenagers should read books that they will also enjoy as adults.",
            "D": " It makes sense to have a whole series as well as individual books."
        },
        "resposta": "B"
    },
    {
        "id": "3e95ed1a",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 5 - </strong>Which book does the writer feel shouldn&rsquo;t be on the list?</p>",
        "audio": "",
        "alternativas": {
            "A": "Jane Eyre",
            "B": "The Diary of a Young Girl",
            "C": "The Lord of the Rings",
            "D": "Lord of the Flies"
        },
        "resposta": "C"
    },
    {
        "id": "baaf290f",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 6 - </strong>What does the writer intend to do?</p>",
        "audio": "",
        "alternativas": {
            "A": "be more fully developed in future",
            "B": "prompt pupils to read more widely",
            "C": "enable pupils to write more effectively",
            "D": "provide a useful topic for discussion in class"
        },
        "resposta": "B"
    },
    {
        "id": "98125938",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<h3 style=\"text-align: justify;\"><strong>The fake hairdresser remembers</strong></h3>\r\n<p style=\"text-align: justify;\">&nbsp;</p>\r\n<p style=\"text-align: justify;\">Some years ago, a British TV company came up with an idea for a reality TV show. People with no experience would be trained in a profession in a very short period of time, then would try and pass themselves off as the real thing with the general public. The show was called&nbsp;<em>Faking It</em>, and the format has since been imitated the world over. One of the first contestants was Gavin Freeborn, a twenty-three-year-old farmer&rsquo;s son, who trained with celebrity hairdresser Trevor Sorbie in London. Gavin remembers the experience.</p>\r\n<p style=\"text-align: justify;\">&lsquo;I was at university, studying for a degree in agriculture, when some friends mentioned that a TV company had advertised for people to take part in&nbsp;<em>Faking It</em>. They were looking for someone who&rsquo;d never picked up a pair of scissors or thought of hairdressing as a career, which I certainly hadn&rsquo;t. I reckoned it would be a laugh. Having spent my school holidays shearing sheep on my parents&rsquo; farm, I was used to the idea of haircutting, but obviously it&rsquo;s harder doing it on people &ndash; because they have an opinion about it!&rsquo;</p>\r\n<p style=\"text-align: justify;\">&lsquo;I&rsquo;d never been to London before and it was so busy that I felt a bit overwhelmed at first. Meeting Trevor for the first time, he seemed really strict, but once he realised I was taking the challenge seriously we got on like a house on fire and they often had to stop filming because we couldn&rsquo;t stop giggling. Fortunately, I didn&rsquo;t have to do any of the washing or sweeping floors other people new to the business have to do. I went straight into blow-drying and cutting instead.&rsquo;</p>\r\n<p style=\"text-align: justify;\">&lsquo;At first I practised on a dummy&rsquo;s head, which was a welcome safety net, but I did make a really bad mistake halfway through filming when I was cutting one real man&rsquo;s hair. I&rsquo;d been shown how to use clippers to get a cropped effect but hadn&rsquo;t been warned to angle the comb. I ended up shaving off a huge patch of hair! He couldn&rsquo;t see what I&rsquo;d done, but the camera crew couldn&rsquo;t stop laughing, so it was obvious I&rsquo;d made a mistake. Luckily, I managed to rectify the situation and told the client, who was alright about it, so I forgave them.&rsquo;</p>\r\n<p style=\"text-align: justify;\">&lsquo;By the day of my final test, I knew I was capable but I felt sick with nerves. I didn&rsquo;t want to let Trevor down. But even though I failed to convince the client that I was a real hairdresser, she approved of the haircut and the judges were impressed by it, too. It didn&rsquo;t worry me at the time but, looking back now, I think it was a bit unfair that I was penalised for taking too long &ndash; and hour-and-a-half &ndash; when I&rsquo;d been taught the most important thing was to ensure your client walks out of the salon feeling like a million dollars.&rsquo;</p>\r\n<p style=\"text-align: justify;\">&lsquo;After the programme, I went home for a week but I decided to come back to London because I&rsquo;d fallen in love with the buzz of the city. People in town kept stopping and staring at me as if I was famous. I found this unnerving at first, but with time I got used to it. There were a few comments about me being too full of myself, but I took no notice.&rsquo;</p>\r\n<p style=\"text-align: justify;\">&lsquo;When I agreed to do&nbsp;<em>Faking It</em>, I had no idea how much I was signing my life away, but I couldn&rsquo;t say I have any regrets. The thing is that I&rsquo;ve discovered growing up on a farm doesn&rsquo;t mean I can&rsquo;t work in a creative field. What&rsquo;s more, I&rsquo;ve now got choices I didn&rsquo;t realise I had, which is brilliant. Although I still keep in contact with everyone from Trevor&rsquo;s salon, and we all go out when I&rsquo;m in London, I&rsquo;m hardly a celebrity anymore.&rsquo;</p>\r\n<p style=\"text-align: justify;\">You are going to read an article about a man who appeared on a reality TV programme.&nbsp;For questions&nbsp;<strong>1-6</strong>, choose the answer (<strong>A</strong>,&nbsp;<strong>B</strong>,&nbsp;<strong>C</strong>&nbsp;or&nbsp;<strong>D</strong>) which you think fits best according to the text.</p>\r\n<p><strong>QUESTION 1 - </strong>Why did Gavin first apply to be on the programme?</p>",
        "audio": "",
        "alternativas": {
            "A": "He thought it would be fun.",
            "B": "He liked the idea of going to London.",
            "C": "His friends managed to talk him into it.",
            "D": "He had some experience of hairdressing."
        },
        "resposta": "A"
    },
    {
        "id": "d04142e5",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 2 - </strong>How did Gavin feel about the hairdressing mistake he made one day?</p>",
        "audio": "",
        "alternativas": {
            "A": "sorry that the client was dissatisfied",
            "B": "relieved that the client didn’t notice it",
            "C": "pleased that he was able to find a solution",
            "D": "annoyed by the reaction of the camera crew"
        },
        "resposta": "C"
    },
    {
        "id": "4dccbbf8",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 3 - </strong>How did Gavin feel on the day of his final test?</p>",
        "audio": "",
        "alternativas": {
            "A": "unsure if he was good enough",
            "B": "worried that he might not succeed",
            "C": "unconvinced that the client was really happy",
            "D": "disappointed by the feedback from the judges"
        },
        "resposta": "B"
    },
    {
        "id": "4cd1fe8d",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 4 - </strong>Thinking about the final test now, Gavin feels that he</p>",
        "audio": "",
        "alternativas": {
            "A": "was too slow in completing the haircut.",
            "B": "didn’t take enough notice of his client’s wishes.",
            "C": "was unjustly criticised for one aspect of his performance.",
            "D": "should have paid some attention to things he’d been taught."
        },
        "resposta": "C"
    },
    {
        "id": "067f2644",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 5 - </strong>What does the word &lsquo;it&rsquo; in line 33 refer to?</p>",
        "audio": "",
        "alternativas": {
            "A": "people making comments about Gavin",
            "B": "people looking at Gavin in the street.",
            "C": "Gavin feeling proud of himself",
            "D": "Gavin feeling uncomfortable"
        },
        "resposta": "B"
    },
    {
        "id": "60fee33f",
        "nivel": "b2",
        "tipo": "reading",
        "enunciado": "<p><strong>QUESTION 6 - </strong>Looking back on the whole experience, Gavin now</p>",
        "audio": "",
        "alternativas": {
            "A": "wishes he’d thought more carefully before applying.",
            "B": "realises that his life is different as a result.",
            "C": "appreciates his farm upbringing more.",
            "D": "accepts that it’s helped him socially."
        },
        "resposta": "B"
    },
    {
        "id": "5d55849a",
        "nivel": "b2",
        "tipo": "use_of_english",
        "enunciado": "<p>For questions&nbsp;<strong>1-9</strong>, read the text below and decide which answer (<strong>A</strong>,&nbsp;<strong>B</strong>,&nbsp;<strong>C</strong>&nbsp;or&nbsp;<strong>D</strong>) best fits each gap.</p>\r\n<h3 dir=\"ltr\">Why you should read fiction</h3>\r\n<p dir=\"ltr\">At school, the (1)&hellip;&hellip;&hellip;&hellip;&hellip; majority of what we learn is factual. In history lessons we memorise names and dates; in science we have to cope (2)&hellip;&hellip;&hellip;&hellip;&hellip; chemical formulas and complex equations; in maths it&rsquo;s all numbers and signs. It&rsquo;s only in language lessons where we may (3)&hellip;&hellip;&hellip;&hellip;&hellip; fiction. Some people would argue that there&rsquo;s (4)&hellip;&hellip;&hellip;&hellip;&hellip; point in reading something which is &lsquo;made up&rsquo;. If this is the (5)&hellip;&hellip;&hellip;&hellip;&hellip;, why do language teachers encourage their students to look at anything (6)&hellip;&hellip;&hellip;&hellip;&hellip; from dictionaries and reference materials?</p>\r\n<p dir=\"ltr\">It is because they are (7)&hellip;&hellip;&hellip;&hellip;&hellip; of the benefits that reading brings. It isn&rsquo;t simply because reading fiction helps us (8)&hellip;&hellip;&hellip;&hellip;&hellip; reality for a while and switch off from our everyday routines. Reading fiction also teaches us to see the world through other people&rsquo;s eyes. It (9)&hellip;&hellip;&hellip;&hellip;&hellip; us to understand the feelings of others, making us more empathetic. Fiction, in other words, helps us be better friends.</p>\r\n<p><strong>QUESTION 1 - </strong></p>",
        "audio": "",
        "alternativas": {
            "A": "vast    ",
            "B": "wide   ",
            "C": " far   ",
            "D": "high"
        },
        "resposta": "A"
    },
    {
        "id": "fe93789f",
        "nivel": "b2",
        "tipo": "use_of_english",
        "enunciado": "<h3 dir=\"ltr\">Why you should read fiction</h3>\r\n<p dir=\"ltr\">At school, the (1)&hellip;&hellip;&hellip;&hellip;&hellip; majority of what we learn is factual. In history lessons we memorise names and dates; in science we have to cope (2)&hellip;&hellip;&hellip;&hellip;&hellip; chemical formulas and complex equations; in maths it&rsquo;s all numbers and signs. It&rsquo;s only in language lessons where we may (3)&hellip;&hellip;&hellip;&hellip;&hellip; fiction. Some people would argue that there&rsquo;s (4)&hellip;&hellip;&hellip;&hellip;&hellip; point in reading something which is &lsquo;made up&rsquo;. If this is the (5)&hellip;&hellip;&hellip;&hellip;&hellip;, why do language teachers encourage their students to look at anything (6)&hellip;&hellip;&hellip;&hellip;&hellip; from dictionaries and reference materials?</p>\r\n<p dir=\"ltr\">It is because they are (7)&hellip;&hellip;&hellip;&hellip;&hellip; of the benefits that reading brings. It isn&rsquo;t simply because reading fiction helps us (8)&hellip;&hellip;&hellip;&hellip;&hellip; reality for a while and switch off from our everyday routines. Reading fiction also teaches us to see the world through other people&rsquo;s eyes. It (9)&hellip;&hellip;&hellip;&hellip;&hellip; us to understand the feelings of others, making us more empathetic. Fiction, in other words, helps us be better friends.</p>\r\n<p><strong>QUESTION 2 -&nbsp;</strong></p>",
        "audio": "",
        "alternativas": {
            "A": "for ",
            "B": "on     ",
            "C": "by ",
            "D": "with"
        },
        "resposta": "D"
    },
    {
        "id": "13140fd4",
        "nivel": "b2",
        "tipo": "use_of_english",
        "enunciado": "<h3 dir=\"ltr\">Why you should read fiction</h3>\r\n<p dir=\"ltr\">At school, the (1)&hellip;&hellip;&hellip;&hellip;&hellip; majority of what we learn is factual. In history lessons we memorise names and dates; in science we have to cope (2)&hellip;&hellip;&hellip;&hellip;&hellip; chemical formulas and complex equations; in maths it&rsquo;s all numbers and signs. It&rsquo;s only in language lessons where we may (3)&hellip;&hellip;&hellip;&hellip;&hellip; fiction. Some people would argue that there&rsquo;s (4)&hellip;&hellip;&hellip;&hellip;&hellip; point in reading something which is &lsquo;made up&rsquo;. If this is the (5)&hellip;&hellip;&hellip;&hellip;&hellip;, why do language teachers encourage their students to look at anything (6)&hellip;&hellip;&hellip;&hellip;&hellip; from dictionaries and reference materials?</p>\r\n<p dir=\"ltr\">It is because they are (7)&hellip;&hellip;&hellip;&hellip;&hellip; of the benefits that reading brings. It isn&rsquo;t simply because reading fiction helps us (8)&hellip;&hellip;&hellip;&hellip;&hellip; reality for a while and switch off from our everyday routines. Reading fiction also teaches us to see the world through other people&rsquo;s eyes. It (9)&hellip;&hellip;&hellip;&hellip;&hellip; us to understand the feelings of others, making us more empathetic. Fiction, in other words, helps us be better friends.</p>\r\n<p><strong>QUESTION 3 -&nbsp;</strong></p>",
        "audio": "",
        "alternativas": {
            "A": "come up",
            "B": "come across ",
            "C": "come about ",
            "D": "come over"
        },
        "resposta": "B"
    },
    {
        "id": "d87aebfd",
        "nivel": "b2",
        "tipo": "use_of_english",
        "enunciado": "<h3 dir=\"ltr\">Why you should read fiction</h3>\r\n<p dir=\"ltr\">At school, the (1)&hellip;&hellip;&hellip;&hellip;&hellip; majority of what we learn is factual. In history lessons we memorise names and dates; in science we have to cope (2)&hellip;&hellip;&hellip;&hellip;&hellip; chemical formulas and complex equations; in maths it&rsquo;s all numbers and signs. It&rsquo;s only in language lessons where we may (3)&hellip;&hellip;&hellip;&hellip;&hellip; fiction. Some people would argue that there&rsquo;s (4)&hellip;&hellip;&hellip;&hellip;&hellip; point in reading something which is &lsquo;made up&rsquo;. If this is the (5)&hellip;&hellip;&hellip;&hellip;&hellip;, why do language teachers encourage their students to look at anything (6)&hellip;&hellip;&hellip;&hellip;&hellip; from dictionaries and reference materials?</p>\r\n<p dir=\"ltr\">It is because they are (7)&hellip;&hellip;&hellip;&hellip;&hellip; of the benefits that reading brings. It isn&rsquo;t simply because reading fiction helps us (8)&hellip;&hellip;&hellip;&hellip;&hellip; reality for a while and switch off from our everyday routines. Reading fiction also teaches us to see the world through other people&rsquo;s eyes. It (9)&hellip;&hellip;&hellip;&hellip;&hellip; us to understand the feelings of others, making us more empathetic. Fiction, in other words, helps us be better friends.</p>\r\n<p><strong>QUESTION 4 -&nbsp;</strong></p>",
        "audio": "",
        "alternativas": {
            "A": "little   ",
            "B": "slight    ",
            "C": "minimal   ",
            "D": "hardly"
        },
        "resposta": "A"
    },
    {
        "id": "55a79eb9",
        "nivel": "b2",
        "tipo": "use_of_english",
        "enunciado": "<h3 dir=\"ltr\">Why you should read fiction</h3>\r\n<p dir=\"ltr\">At school, the (1)&hellip;&hellip;&hellip;&hellip;&hellip; majority of what we learn is factual. In history lessons we memorise names and dates; in science we have to cope (2)&hellip;&hellip;&hellip;&hellip;&hellip; chemical formulas and complex equations; in maths it&rsquo;s all numbers and signs. It&rsquo;s only in language lessons where we may (3)&hellip;&hellip;&hellip;&hellip;&hellip; fiction. Some people would argue that there&rsquo;s (4)&hellip;&hellip;&hellip;&hellip;&hellip; point in reading something which is &lsquo;made up&rsquo;. If this is the (5)&hellip;&hellip;&hellip;&hellip;&hellip;, why do language teachers encourage their students to look at anything (6)&hellip;&hellip;&hellip;&hellip;&hellip; from dictionaries and reference materials?</p>\r\n<p dir=\"ltr\">It is because they are (7)&hellip;&hellip;&hellip;&hellip;&hellip; of the benefits that reading brings. It isn&rsquo;t simply because reading fiction helps us (8)&hellip;&hellip;&hellip;&hellip;&hellip; reality for a while and switch off from our everyday routines. Reading fiction also teaches us to see the world through other people&rsquo;s eyes. It (9)&hellip;&hellip;&hellip;&hellip;&hellip; us to understand the feelings of others, making us more empathetic. Fiction, in other words, helps us be better friends.</p>\r\n<p><strong>QUESTION 5 - </strong><strong>&nbsp;&nbsp;</strong></p>",
        "audio": "",
        "alternativas": {
            "A": "issue",
            "B": "matter   ",
            "C": "case  ",
            "D": "point"
        },
        "resposta": "C"
    },
    {
        "id": "752ff01f",
        "nivel": "b2",
        "tipo": "use_of_english",
        "enunciado": "<h3 dir=\"ltr\">Why you should read fiction</h3>\r\n<p dir=\"ltr\">At school, the (1)&hellip;&hellip;&hellip;&hellip;&hellip; majority of what we learn is factual. In history lessons we memorise names and dates; in science we have to cope (2)&hellip;&hellip;&hellip;&hellip;&hellip; chemical formulas and complex equations; in maths it&rsquo;s all numbers and signs. It&rsquo;s only in language lessons where we may (3)&hellip;&hellip;&hellip;&hellip;&hellip; fiction. Some people would argue that there&rsquo;s (4)&hellip;&hellip;&hellip;&hellip;&hellip; point in reading something which is &lsquo;made up&rsquo;. If this is the (5)&hellip;&hellip;&hellip;&hellip;&hellip;, why do language teachers encourage their students to look at anything (6)&hellip;&hellip;&hellip;&hellip;&hellip; from dictionaries and reference materials?</p>\r\n<p dir=\"ltr\">It is because they are (7)&hellip;&hellip;&hellip;&hellip;&hellip; of the benefits that reading brings. It isn&rsquo;t simply because reading fiction helps us (8)&hellip;&hellip;&hellip;&hellip;&hellip; reality for a while and switch off from our everyday routines. Reading fiction also teaches us to see the world through other people&rsquo;s eyes. It (9)&hellip;&hellip;&hellip;&hellip;&hellip; us to understand the feelings of others, making us more empathetic. Fiction, in other words, helps us be better friends.</p>\r\n<p><strong>QUESTION 6 - </strong><strong>&nbsp;&nbsp;</strong></p>",
        "audio": "",
        "alternativas": {
            "A": "except ",
            "B": "apart ",
            "C": "other  ",
            "D": "beside"
        },
        "resposta": "B"
    },
    {
        "id": "59c43a7c",
        "nivel": "b2",
        "tipo": "use_of_english",
        "enunciado": "<h3 dir=\"ltr\">Why you should read fiction</h3>\r\n<p dir=\"ltr\">At school, the (1)&hellip;&hellip;&hellip;&hellip;&hellip; majority of what we learn is factual. In history lessons we memorise names and dates; in science we have to cope (2)&hellip;&hellip;&hellip;&hellip;&hellip; chemical formulas and complex equations; in maths it&rsquo;s all numbers and signs. It&rsquo;s only in language lessons where we may (3)&hellip;&hellip;&hellip;&hellip;&hellip; fiction. Some people would argue that there&rsquo;s (4)&hellip;&hellip;&hellip;&hellip;&hellip; point in reading something which is &lsquo;made up&rsquo;. If this is the (5)&hellip;&hellip;&hellip;&hellip;&hellip;, why do language teachers encourage their students to look at anything (6)&hellip;&hellip;&hellip;&hellip;&hellip; from dictionaries and reference materials?</p>\r\n<p dir=\"ltr\">It is because they are (7)&hellip;&hellip;&hellip;&hellip;&hellip; of the benefits that reading brings. It isn&rsquo;t simply because reading fiction helps us (8)&hellip;&hellip;&hellip;&hellip;&hellip; reality for a while and switch off from our everyday routines. Reading fiction also teaches us to see the world through other people&rsquo;s eyes. It (9)&hellip;&hellip;&hellip;&hellip;&hellip; us to understand the feelings of others, making us more empathetic. Fiction, in other words, helps us be better friends.</p>\r\n<p><strong>QUESTION 7 -&nbsp;</strong></p>",
        "audio": "",
        "alternativas": {
            "A": "aware ",
            "B": "wise",
            "C": "familiar ",
            "D": "sensitive  "
        },
        "resposta": "A"
    },
    {
        "id": "93a62838",
        "nivel": "b2",
        "tipo": "use_of_english",
        "enunciado": "<h3 dir=\"ltr\">Why you should read fiction</h3>\r\n<p dir=\"ltr\">At school, the (1)&hellip;&hellip;&hellip;&hellip;&hellip; majority of what we learn is factual. In history lessons we memorise names and dates; in science we have to cope (2)&hellip;&hellip;&hellip;&hellip;&hellip; chemical formulas and complex equations; in maths it&rsquo;s all numbers and signs. It&rsquo;s only in language lessons where we may (3)&hellip;&hellip;&hellip;&hellip;&hellip; fiction. Some people would argue that there&rsquo;s (4)&hellip;&hellip;&hellip;&hellip;&hellip; point in reading something which is &lsquo;made up&rsquo;. If this is the (5)&hellip;&hellip;&hellip;&hellip;&hellip;, why do language teachers encourage their students to look at anything (6)&hellip;&hellip;&hellip;&hellip;&hellip; from dictionaries and reference materials?</p>\r\n<p dir=\"ltr\">It is because they are (7)&hellip;&hellip;&hellip;&hellip;&hellip; of the benefits that reading brings. It isn&rsquo;t simply because reading fiction helps us (8)&hellip;&hellip;&hellip;&hellip;&hellip; reality for a while and switch off from our everyday routines. Reading fiction also teaches us to see the world through other people&rsquo;s eyes. It (9)&hellip;&hellip;&hellip;&hellip;&hellip; us to understand the feelings of others, making us more empathetic. Fiction, in other words, helps us be better friends.</p>\r\n<p><strong>QUESTION 8 -&nbsp;</strong></p>",
        "audio": "",
        "alternativas": {
            "A": "depart ",
            "B": "miss  ",
            "C": "escape ",
            "D": "break"
        },
        "resposta": "C"
    },
    {
        "id": "26f28719",
        "nivel": "b2",
        "tipo": "use_of_english",
        "enunciado": "<h3 dir=\"ltr\">Why you should read fiction</h3>\r\n<p dir=\"ltr\">At school, the (1)&hellip;&hellip;&hellip;&hellip;&hellip; majority of what we learn is factual. In history lessons we memorise names and dates; in science we have to cope (2)&hellip;&hellip;&hellip;&hellip;&hellip; chemical formulas and complex equations; in maths it&rsquo;s all numbers and signs. It&rsquo;s only in language lessons where we may (3)&hellip;&hellip;&hellip;&hellip;&hellip; fiction. Some people would argue that there&rsquo;s (4)&hellip;&hellip;&hellip;&hellip;&hellip; point in reading something which is &lsquo;made up&rsquo;. If this is the (5)&hellip;&hellip;&hellip;&hellip;&hellip;, why do language teachers encourage their students to look at anything (6)&hellip;&hellip;&hellip;&hellip;&hellip; from dictionaries and reference materials?</p>\r\n<p dir=\"ltr\">It is because they are (7)&hellip;&hellip;&hellip;&hellip;&hellip; of the benefits that reading brings. It isn&rsquo;t simply because reading fiction helps us (8)&hellip;&hellip;&hellip;&hellip;&hellip; reality for a while and switch off from our everyday routines. Reading fiction also teaches us to see the world through other people&rsquo;s eyes. It (9)&hellip;&hellip;&hellip;&hellip;&hellip; us to understand the feelings of others, making us more empathetic. Fiction, in other words, helps us be better friends.</p>\r\n<p><strong>QUESTION 9 -&nbsp;</strong></p>",
        "audio": "",
        "alternativas": {
            "A": "lets   ",
            "B": "authorises",
            "C": "makes  ",
            "D": "enables"
        },
        "resposta": "D"
    },
    {
        "id": "170d8a22",
        "nivel": "b2",
        "tipo": "listening",
        "enunciado": "<p>You will hear people talking in eight different situations.</p>\r\n<p>For questions&nbsp;<strong>1-8</strong>, choose the best answer&nbsp;<strong>A</strong>,&nbsp;<strong>B</strong>&nbsp;or&nbsp;<strong>C</strong>.</p>\r\n<p><strong>QUESTION 1 - </strong>You hear a restaurant manager talking about the cooks who work for him.</p>\r\n<p>What does he say about them?</p>",
        "audio": "https://englishpracticetest.net/wp-content/uploads/2022/11/b2-test-01-2.mp3",
        "alternativas": {
            "A": "They dislike cleaning tasks.",
            "B": "They have a choice of jobs.",
            "C": "They help to decide the menu.",
            "D": "-"
        },
        "resposta": "B"
    },
    {
        "id": "f9e5f6c0",
        "nivel": "b2",
        "tipo": "listening",
        "enunciado": "<p><strong>QUESTION 2 -&nbsp;</strong>You hear a woman talking about a new book.</p>\r\n<p>What does she particularly like about the book?</p>",
        "audio": "",
        "alternativas": {
            "A": "It is educational.",
            "B": "It is well organised.",
            "C": "It is enjoyable.",
            "D": "-"
        },
        "resposta": "C"
    },
    {
        "id": "6ea78228",
        "nivel": "b2",
        "tipo": "listening",
        "enunciado": "<p><strong>QUESTION 3 - </strong>You hear the writer of a television soap opera being interviewed about the programme.</p>\r\n<p>What will happen next in the story?</p>\r\n<p><strong>&nbsp;&nbsp;</strong></p>",
        "audio": "",
        "alternativas": {
            "A": "Someone will make an important decision.",
            "B": "Someone will go away unexpectedly.",
            "C": "Someone will learn the truth at last.",
            "D": "-"
        },
        "resposta": "C"
    },
    {
        "id": "55150d17",
        "nivel": "b2",
        "tipo": "listening",
        "enunciado": "<p><strong>QUESTION 4 - </strong>You hear part of a radio interview.</p>\r\n<p>Who is speaking?</p>",
        "audio": "",
        "alternativas": {
            "A": "a taxi driver",
            "B": "a porter",
            "C": "a tourist guide",
            "D": "-"
        },
        "resposta": "B"
    },
    {
        "id": "cf57f097",
        "nivel": "b2",
        "tipo": "listening",
        "enunciado": "<p><strong>QUESTION 5 - </strong>You hear a woman talking about how she keeps fit.</p>\r\n<p>Why did she decide to take up line dancing?</p>",
        "audio": "",
        "alternativas": {
            "A": "She thought the pace would suit her.",
            "B": "She had heard about it on television.",
            "C": "She wanted to try exercising to music.",
            "D": "-"
        },
        "resposta": "A"
    },
    {
        "id": "70c6d3e4",
        "nivel": "b2",
        "tipo": "listening",
        "enunciado": "<p><strong>QUESTION 6 -&nbsp;</strong>You overhear a conversation in a restaurant.</p>\r\n<p>What does the woman think about the food she has just eaten?</p>",
        "audio": "",
        "alternativas": {
            "A": "It was expensive.",
            "B": "It was delicious.",
            "C": "It looked wonderful.",
            "D": "-"
        },
        "resposta": "B"
    },
    {
        "id": "e385e312",
        "nivel": "b2",
        "tipo": "listening",
        "enunciado": "<p><strong>QUESTION 7 - </strong>You turn on the radio and hear a man talking.</p>\r\n<p>What is he talking about?</p>",
        "audio": "",
        "alternativas": {
            "A": "drawing pictures",
            "B": "writing fiction",
            "C": "composing music",
            "D": "-"
        },
        "resposta": "C"
    },
    {
        "id": "46f0726e",
        "nivel": "b2",
        "tipo": "listening",
        "enunciado": "<p><strong>QUESTION 8 - </strong>You overhear a student phoning her parents.</p>\r\n<p>What is her opinion of the place she is living in while at college?</p>",
        "audio": "",
        "alternativas": {
            "A": "She is not sure she will have enough room to study.",
            "B": "She has difficulty in working because of the noise.",
            "C": "She does not get on well with her room-mates.",
            "D": "-"
        },
        "resposta": "A"
    },
    {
        "id": "4ab38299",
        "nivel": "c1",
        "tipo": "reading",
        "enunciado": "<p>dasdsa</p>",
        "audio": "",
        "alternativas": {
            "A": "q",
            "B": "q",
            "C": "q",
            "D": "q"
        },
        "resposta": "D"
    }
]